Repository: nikvkov/salesapp
Catalog: ExsalesMobileApp/ExsalesMobileApp/lang/LangResources.*.resx
Languages: de, ru

# AccountPageButtonFunction
source: Function
de: Funktionen
ru: Функции

# AccountPageButtonPersonalData
source: Personal data
de: Persönliche Daten
ru: Личные данные

# AccountPageFunctionLabelText
source: Get Started
de: Fangen Sie an
ru: Начните работу

# AccountPagePersonalDataLabelText
source: Enter your personal information
de: Geben Sie Ihre persönlichen Daten ein
ru: Укажите личную информацию

# AccountPageRoleTextLabel
source: Your current role is
de: Ihre derzeitige Rolle ist
ru: Ваша текушая роль -

# AccountPageWelcomeText
source: Welcome,
de: Hallo,
ru: Здравствуйте,

source: Error
ru: Ошибка

# PageBack
source: Back
de: Zurück
ru: Назад

# PersonPageButtonEditText
source: Edit
de: Bearbeiten
ru: Редактировать

# PersonPageButtonSaveText
source: Save
de: Speichern
ru: Сохранить

# PersonPageEmailLabelText
source: Your email
de: Deine E-Mail
ru: Ваш email

# PersonPageEmailPlaceholder
source: Put your email
de: Setzen Sie Ihre E-Mail
ru: Укажите email

# PersonPageFirstNameLabelText
source: First name
de: Vorname
ru: Имя

# PersonPageFirstNamePlaceholder
source: Put your first name
de: Setzen Sie Ihren Vornamen
ru: Укажите имя

# PersonPageLastNameLabelText
source: Last name
de: Nachname
ru: Фамилия

# PersonPageLastNamePlaceholder
source: Put your last name
de: Setzen Sie Ihren Nachnamen
ru: Укажите фамилию

# PersonPageMessageBadEmail
source: Check your email!
de: Check deine E-Mails!
ru: Проверьте Email!

# PersonPageMessageBadFirstName
source: Check the specified name!
de: Überprüfen Sie den angegebenen Namen!
ru: Проверьте указанное имя!

# PersonPageMessageBadLastName
source: Check the surname!
de: Überprüfen Sie den Nachnamen!
ru: Проверьте указанную фамилию!

# PersonPageMessageBadPassword
source: The password must contain at least 8 characters!
de: Das Passwort muss mindestens 8 Zeichen enthalten!
ru: Пароль должен содержать не немее 8 символов!

# PersonPageMessageBadPhone
source: Check your phone!
de: Schau auf dein Telefon!
ru: Проверьте указанный телефон!

# PersonPageMessageChangeEmail
source: You changed your email address. Check that the email is correct to avoid authorization problems
de: Sie haben Ihre E-Mail-Adresse geändert. Überprüfen Sie, ob die E-Mail korrekt ist, um Autorisierungsprobleme zu vermeiden
ru: Ваш email был изменен! Проверьте правильность нового email для избежания проблем с авторизацией

# PersonPageMessageNotUpdateData
source: Error updating data! Check that the data is correct and try again
de: Fehler beim Aktualisieren der Daten! Überprüfen Sie, ob die Daten korrekt sind, und versuchen Sie es erneut
ru: Ошибка обновления! Проверьте правильность указанных данных и попробуйте еще раз

# PersonPageMessageUpdateData
source: User data updated!
de: Benutzerdaten aktualisiert!
ru: Данные пользователя обновлены!

# PersonPagePasswordLabelText
source: Need new password?
de: Brauchen Sie ein neues Passwort?
ru: Хотите сменить пароль?

# PersonPagePasswordPlaceholder
source: Put new password
de: Setzen Sie ein neues Passwort
ru: Укажите новый пароль

# PersonPagePhoneLabelText
source: Your phone
de: Dein Telefon
ru: Ваш телефон

# PersonPagePhonePlaceholder
source: Put your phone
de: Setze dein Handy ein
ru: Укажите телефон

# PersonPageTitleLabelText
source: Your personal information
de: Ihre persönliche Information
ru: Ваши личные данные

# RegPageBtSend
source: Send
de: Senden
ru: Отправить

# RegPageDataError
source: Check the specified data and select a role!
de: Überprüfen Sie die angegebenen Daten und wählen Sie eine Rolle!
ru: Проверьте указанные данные и выберите роль!

# RegPageEmailPlaceholder
source: Put email
de: E-Mail eingeben
ru: Укажите email

# RegPageLabelRegText
source: The password will be sent to the specified email
de: Das Passwort wird an Ihre E-Mail-Adresse gesendet
ru: Пароль будет вымлан вам на почту

# RegPagePickerTitle
source: Role
de: Rolle
ru: Роль

# RegPageRoles
source: Manager:Seller
de: Manager: Verkäufer
ru: Менеджер:Продавец

# StartPageBtRegister
source: Register
de: Eintragung
ru: Регистрация

# StartPageBtSignIn
source: Sign In
de: Eintreten
ru: Войти

# StartPageEnterMessageWarning
source: Authorisation Error. Check the information provided!
de: Autorisierungsfehler Überprüfen Sie die bereitgestellten Informationen!
ru: Ошибка авторизации. Проверьте указанные данные!

# StartPageLabelRegister
source: Create new account?
de: Ein neues Konto erstellen?
ru: Создать новый аккаунт?

# StartPageLoginPassword
source: Password
de: Passwort
ru: Пароль

# StartPageLoginPlaceholder
source: Login
ru: Логин

source: Success
de: Erfolg
ru: Успех

source: Warning
de: Warnung
ru: Предупреждение
